app/controllers/clients_controller.rb

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "address", "created_at", "updated_at", "phone_number", "email_address", "verified", "md5") VALUES('asdfasdfasdf', 'asdfasdfasdfasdf', '2011-04-22 01:04:28', '2011-04-22 01:04:28', '5555555555555555555555', 'a@b.com', 'f', NULL)

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
UPDATE "clients" SET "updated_at" = '2011-04-22 19:48:18', "verified" = 't', "md5" = 'e963b31fd5295b035d4a43b9446fe677', "phone_number" = '5555555555555557' WHERE "id" = 10

  def destroy
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT * FROM "clients" WHERE ("clients"."id" = 2)
DELETE FROM "clients" WHERE "id" = 2